# Clear Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireTypeSet..::..Clear Method
WireTypeSet Class See Also
---
Removes every wire type from the set, rendering it empty.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Clear()
```

Visual Basic
---
```text
Public Overridable Sub Clear
```

Visual C++
---
```text
public:
virtual void Clear()
```

# See Also
WireTypeSet Class
Autodesk.Revit.DB.Electrical Namespace